app/Controllers/user/Aboutctrl.php

SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Tentang'
 LIMIT 1
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
---
    public function index()
    {
        $metaModel = new MetaModel();
        $meta = $metaModel->where('nama_halaman', 'Tentang')->first();

        $canonicalUrl = base_url('/tentang');
        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'meta' => $meta,
            'canonicalUrl' => $canonicalUrl,
        ];