app/Controllers/user/Homectrl.php

SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Beranda'
 LIMIT 1
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
---
    public function index()
    {
        // SEO
    $metaModel = new MetaModel;
    $meta = $metaModel->where('nama_halaman', 'Beranda')->first();

    $canonicalUrl = base_url('/beranda');

    $lang = session()->get('lang') ?? 'en';

    // Ambil data dari model
    $data = [
        'profil' => $this->ProfilModel->findAll(),
        'tbslider' => $this->SliderModel->findAll(),
        'tbproduk' => $this->ProdukModel->findAll(),
        'artikelterbaru' => $this->ArtikelModel->getArtikelTerbaru(), // Ambil artikel terbaru
        'meta' => $meta,
        'canonicalUrl' => $canonicalUrl,
        'lang' => $lang,  // Tambahkan canonical URL ke data
    ];